src/test/resources/requests/get_records_5_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecords maxRecords="10" outputFormat="text/xml" outputSchema="csw:profile"
			requestId="csw:1" resultType="results" startPosition="1"
			xmlns="http://www.opengis.net/cat/csw/2.0.2" service="CSW" version="2.0.2">
			<Query typeNames="csw:dataset">
				<ElementSetName typeNames="">brief</ElementSetName>
				<!-- (denominator > 50 AND denominator < 100) OR (denominator >= 10 AND denominator <= 15) -->
				<Constraint version="1.1.0">
					<Filter xmlns="http://www.opengis.net/ogc">
						<Or>
							<And>
								<PropertyIsGreaterThan>
									<PropertyName>Denominator</PropertyName>
									<Literal>50</Literal>
								</PropertyIsGreaterThan>
								<PropertyIsLessThan>
									<PropertyName>Denominator</PropertyName>
									<Literal>100</Literal>
								</PropertyIsLessThan>
							</And>
							<And>
								<PropertyIsGreaterThanOrEqualTo>
									<PropertyName>Denominator</PropertyName>
									<Literal>10</Literal>
								</PropertyIsGreaterThanOrEqualTo>
								<PropertyIsLessThanOrEqualTo>
									<PropertyName>Denominator</PropertyName>
									<Literal>15</Literal>
								</PropertyIsLessThanOrEqualTo>
							</And>
						</Or>
					</Filter>
				</Constraint>
			</Query>
		</GetRecords>
	</soapenv:Body>
</soapenv:Envelope>