src/test/resources/requests/get_records_4_soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<GetRecords maxRecords="10" outputFormat="text/xml" outputSchema="csw:profile"
			requestId="csw:1" resultType="results" startPosition="1"
			xmlns="http://www.opengis.net/cat/csw/2.0.2" service="CSW" version="2.0.2">
			<Query typeNames="csw:dataset">
				<ElementSetName typeNames="">brief</ElementSetName>
				<Constraint version="1.1.0">
					<Filter xmlns="http://www.opengis.net/ogc">
					<!-- 
						<Or>
							<PropertyIsEqualTo>
								<PropertyName>AnyText</PropertyName>
								<Literal>saale</Literal>
							</PropertyIsEqualTo>
					-->
							<BBOX xmlns:gml="http://www.opengis.net/gml">
								<PropertyName>Geometry</PropertyName>
								<gml:Box srsName="http://www.opengis.net/gml/srs/epsg.xml#4326">
									<gml:coordinates>13.0,31.5 35.5,42.8</gml:coordinates>
								</gml:Box>
							</BBOX>
					<!--
						</Or> 
					-->
					</Filter>
				</Constraint>
			</Query>
		</GetRecords>
	</soapenv:Body>
</soapenv:Envelope>