deegree-demos/deegree-csw-demo/src/main/webapp/requests/csw/examples/GetCapabilities/xml/getCapabilitiesSOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1">
      <wsse:UsernameToken>
        <wsse:Username>User3</wsse:Username>
        <wsse:Password
          Type="http://docs.oasis-open.org/wss/2004/01/
                        oasis-200401-wss-username-token-profile-1.0#PasswordText">pass3</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <GetCapabilities
      service="CSW"
      xmlns="http://www.opengis.net/cat/csw/2.0.2"
      xsi:schemaLocation="http://www.opengis.net/cat/csw/2.0.2 http://schemas.opengis.net/csw/2.0.2/CSW-discovery.xsd"
      xmlns:xlink="http://www.w3.org/1999/xlink"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    </GetCapabilities>
  </soapenv:Body>
</soapenv:Envelope>