52n-sir/src/main/resources/xml/catalogStoredQueries.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    ﻿Copyright (C) 2012
    by 52 North Initiative for Geospatial Open Source Software GmbH

    Contact: Andreas Wytzisk
    52 North Initiative for Geospatial Open Source Software GmbH
    Martin-Luther-King-Weg 24
    48155 Muenster, Germany
    info@52north.org

    This program is free software; you can redistribute and/or modify it under
    the terms of the GNU General Public License version 2 as published by the
    Free Software Foundation.

    This program is distributed WITHOUT ANY WARRANTY; even without the implied
    WARRANTY OF MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
    General Public License for more details.

    You should have received a copy of the GNU General Public License along with
    this program (see gnu-gpl v2.txt). If not, write to the Free Software
    Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA or
    visit the Free Software Foundation web page, http://www.fsf.org.

-->
<!DOCTYPE soapenv>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2"
	xmlns:ogc="http://www.opengis.net/ogc" xmlns:gml="http://www.opengis.net/gml">
	<soapenv:Header />
	<soapenv:Body>
		<csw:Transaction service="CSW" version="2.0.2"
			verboseResponse="false" requestId="1">
			<csw:Insert>
				<rim:RegistryObjectList>

					<!-- stored queries as of OGC 07-144r4 -->
					<rim:AdhocQuery id="urn:ogc:def:ebRIM-Query:OGC:showStoredQueries">
						<rim:QueryExpression queryLanguage="urn:ogc:def:ebRIM-QueryLanguage:CSW-Filter">
<![CDATA[
<csw:Query typeNames="rim:AdhocQuery" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2" xmlns:ogc="http://www.opengis.net/ogc">
	<csw:ElementSetName typeNames="rim:AdhocQuery">full</csw:ElementSetName>   
	<csw:Constraint version="1.1.0">
		<ogc:Filter>
        	<ogc:PropertyIsLike wildCard="%">
            	<ogc:PropertyName>/rim:AdhocQuery/@id</ogc:PropertyName>
				<ogc:Literal>%</ogc:Literal>
			</ogc:PropertyIsLike>
		</ogc:Filter>
	</csw:Constraint>
	<ogc:SortBy/>
</csw:Query>
]]>
						</rim:QueryExpression>
					</rim:AdhocQuery>
					
					<!-- stored query as of OGC 09-163r1 -->

				</rim:RegistryObjectList>
			</csw:Insert>
		</csw:Transaction>
	</soapenv:Body>
</soapenv:Envelope>