service/src/main/resources/xml/catalogStoredQueries.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--

    ﻿Copyright (C) 2012 52°North Initiative for Geospatial Open Source Software GmbH

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<!DOCTYPE soapenv>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2"
	xmlns:ogc="http://www.opengis.net/ogc" xmlns:gml="http://www.opengis.net/gml">
	<soapenv:Header />
	<soapenv:Body>
		<csw:Transaction service="CSW" version="2.0.2"
			verboseResponse="false" requestId="1">
			<csw:Insert>
				<rim:RegistryObjectList>

					<!-- stored queries as of OGC 07-144r4 -->
					<rim:AdhocQuery id="urn:ogc:def:ebRIM-Query:OGC:showStoredQueries">
						<rim:QueryExpression queryLanguage="urn:ogc:def:ebRIM-QueryLanguage:CSW-Filter">
<![CDATA[
<csw:Query typeNames="rim:AdhocQuery" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:csw="http://www.opengis.net/cat/csw/2.0.2" xmlns:ogc="http://www.opengis.net/ogc">
	<csw:ElementSetName typeNames="rim:AdhocQuery">full</csw:ElementSetName>   
	<csw:Constraint version="1.1.0">
		<ogc:Filter>
        	<ogc:PropertyIsLike wildCard="%">
            	<ogc:PropertyName>/rim:AdhocQuery/@id</ogc:PropertyName>
				<ogc:Literal>%</ogc:Literal>
			</ogc:PropertyIsLike>
		</ogc:Filter>
	</csw:Constraint>
	<ogc:SortBy/>
</csw:Query>
]]>
						</rim:QueryExpression>
					</rim:AdhocQuery>
					
					<!-- stored query as of OGC 09-163r1 -->

				</rim:RegistryObjectList>
			</csw:Insert>
		</csw:Transaction>
	</soapenv:Body>
</soapenv:Envelope>